nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimx8mp/common/pin_mux/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI2CPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: AJ7, peripheral: I2C3, signal: i2c_scl, pin_signal: I2C3_SCL, PE: Enabled, HYS: Schmitt, PUE: Weak_Pull_Up, DSE: X1, SION: ENABLED}
  - {pin_num: AJ6, peripheral: I2C3, signal: i2c_sda, pin_signal: I2C3_SDA, PE: Enabled, HYS: Schmitt, PUE: Weak_Pull_Up, DSE: X1, SION: ENABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI2CPins(void) {                             /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_I2C3_SCL_I2C3_SCL, 1U);
    IOMUXC_SetPinConfig(IOMUXC_I2C3_SCL_I2C3_SCL, 
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_I2C3_SDA_I2C3_SDA, 1U);
    IOMUXC_SetPinConfig(IOMUXC_I2C3_SDA_I2C3_SDA, 
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCANPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: AD18, peripheral: FLEXCAN1, signal: can_rx, pin_signal: SPDIF_RX, PUE: Weak_Pull_Up, FSEL: Fast, DSE: X4}
  - {pin_num: AE18, peripheral: FLEXCAN1, signal: can_tx, pin_signal: SPDIF_TX, PUE: Weak_Pull_Up, FSEL: Fast, DSE: X4}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCANPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCANPins(void) {                             /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_SPDIF_RX_CAN1_RX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SPDIF_RX_CAN1_RX, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(1U) |
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_SPDIF_TX_CAN1_TX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SPDIF_TX_CAN1_TX, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(1U) |
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitGPIO5Pins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: AC18, peripheral: GPIO5, signal: 'gpio_io, 05', pin_signal: SPDIF_EXT_CLK, PUE: Weak_Pull_Up}
  - {pin_num: AJ21, peripheral: GPIO5, signal: 'gpio_io, 11', pin_signal: ECSPI2_MOSI}
  - {pin_num: AD8, peripheral: GPIO5, signal: 'gpio_io, 21', pin_signal: I2C4_SDA, SION: ENABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitGPIO5Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitGPIO5Pins(void) {                           /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_ECSPI2_MOSI_GPIO5_IO11, 0U);
    IOMUXC_SetPinMux(IOMUXC_I2C4_SDA_GPIO5_IO21, 1U);
    IOMUXC_SetPinMux(IOMUXC_SPDIF_EXT_CLK_GPIO5_IO05, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SPDIF_EXT_CLK_GPIO5_IO05, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(3U) |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitNET_QOSPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: AH28, peripheral: ENET_QOS, signal: enet_qos_mdc, pin_signal: ENET_MDC, PE: Disabled, DSE: X2}
  - {pin_num: AH29, peripheral: ENET_QOS, signal: enet_qos_mdio, pin_signal: ENET_MDIO, PE: Disabled, DSE: X2}
  - {pin_num: AG29, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_rd, 0', pin_signal: ENET_RD0, PE: Disabled, HYS: Schmitt, FSEL: Fast}
  - {pin_num: AG28, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_rd, 1', pin_signal: ENET_RD1, PE: Disabled, HYS: Schmitt, FSEL: Fast}
  - {pin_num: AF29, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_rd, 2', pin_signal: ENET_RD2, PE: Disabled, HYS: Schmitt, FSEL: Fast}
  - {pin_num: AF28, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_rd, 3', pin_signal: ENET_RD3, PE: Disabled, HYS: Schmitt, FSEL: Fast}
  - {pin_num: AE28, peripheral: ENET_QOS, signal: enet_qos_rgmii_rx_ctl, pin_signal: ENET_RX_CTL, PE: Disabled, HYS: Schmitt, FSEL: Fast}
  - {pin_num: AE29, peripheral: ENET_QOS, signal: enet_qos_rgmii_rxc, pin_signal: ENET_RXC, PE: Disabled, HYS: Schmitt, FSEL: Fast}
  - {pin_num: AC25, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_td, 0', pin_signal: ENET_TD0, PE: Disabled, HYS: Schmitt}
  - {pin_num: AE26, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_td, 1', pin_signal: ENET_TD1, PE: Disabled, HYS: Schmitt}
  - {pin_num: AF26, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_td, 2', pin_signal: ENET_TD2, PE: Disabled, HYS: Schmitt}
  - {pin_num: AD24, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_td, 3', pin_signal: ENET_TD3, PE: Disabled, HYS: Schmitt}
  - {pin_num: AF24, peripheral: ENET_QOS, signal: enet_qos_rgmii_tx_ctl, pin_signal: ENET_TX_CTL, PE: Disabled, HYS: Schmitt}
  - {pin_num: AE24, peripheral: ENET_QOS, signal: enet_qos_rgmii_txc, pin_signal: ENET_TXC, PE: Disabled, HYS: Schmitt}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

